adamkondraciuk/nrfx/mdk/nrf54h20_engb_ppr.svd
        <register>
          <name>GHWCFG4</name>
          <description>User Hardware Configuration 4 Register</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x1E10AA60</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NUMDEVPERIOEPS</name>
              <description>Number of Device Mode Periodic IN Endpoints (NumDevPerioEps)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Value0</name>
                  <description>Number of Periodic IN EPs is 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value1</name>
                  <description>Number of Periodic IN EPs is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value2</name>
                  <description>Number of Periodic IN EPs is 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value3</name>
                  <description>Number of Periodic IN EPs is 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value4</name>
                  <description>Number of Periodic IN EPs is 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value5</name>
                  <description>Number of Periodic IN EPs is 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value6</name>
                  <description>Number of Periodic IN EPs is 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value7</name>
                  <description>Number of Periodic IN EPs is 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value8</name>
                  <description>Number of Periodic IN EPs is 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value9</name>
                  <description>Number of Periodic IN EPs is 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value10</name>
                  <description>Number of Periodic IN EPs is 10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value11</name>
                  <description>Number of Periodic IN EPs is 11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value12</name>
                  <description>Number of Periodic IN EPs is 12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value13</name>
                  <description>Number of Periodic IN EPs is 13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value14</name>
                  <description>Number of Periodic IN EPs is 14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Value15</name>
                  <description>Number of Periodic IN EPs is 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTIALPWRDN</name>
              <description>Enable Partial Power Down (PartialPwrDn)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Partial Power Down disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Partial Power Down enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBFREQ</name>
              <description>Minimum AHB Frequency Less Than 60 MHz (AhbFreq)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Minimum AHB Frequency More Than 60 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Minimum AHB Frequency Less Than 60 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIBERNATION</name>
              <description>Enable Hibernation (Hibernation)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Hibernation feature disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Hibernation feature enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTENDEDHIBERNATION</name>
              <description>Enable Hibernation</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Extended Hibernation feature not enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Extended Hibernation feature enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENHANCEDLPMSUPT1</name>
              <description>Enhanced LPM Support1 (EnhancedLPMSupt1)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Reject L1 Request even if Non-Periodic (Bulk/Interrupt) TxFIFO is not empty.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Accept L1 Request even if Non-Periodic (Bulk/Interrupt) TxFIFO is not empty</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SERVINTFLOW</name>
              <description>Service Interval Flow</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Service Interval Flow not supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Service Interval Flow supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPGISOCSUPT</name>
              <description>Interpacket Gap ISOC OUT Worst-case Support (ipgisocSupt)</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Interpacket Gap ISOC OUT Worst-case Support is Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Interpacket Gap ISOC OUT Worst-case Support is Enabled (Default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACGSUPT</name>
              <description>Active Clock Gating Support</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Active Clock Gating Support</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENHANCEDLPMSUPT</name>
              <description>Enhanced LPM Support (EnhancedLPMSupt)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enhanced LPM Support is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYDATAWIDTH</name>
              <description>UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIDTH1</name>
                  <description>8 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH2</name>
                  <description>16 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH3</name>
                  <description>8/16 bits, software selectable</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMCTLEPS</name>
              <description>Number of Device Mode Control Endpoints in Addition to</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENDPT0</name>
                  <description>End point 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT1</name>
                  <description>End point 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT2</name>
                  <description>End point 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT3</name>
                  <description>End point 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT4</name>
                  <description>End point 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT5</name>
                  <description>End point 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT6</name>
                  <description>End point 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT7</name>
                  <description>End point 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT8</name>
                  <description>End point 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT9</name>
                  <description>End point 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT10</name>
                  <description>End point 10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT11</name>
                  <description>End point 11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT12</name>
                  <description>End point 12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT13</name>
                  <description>End point 13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT14</name>
                  <description>End point 14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT15</name>
                  <description>End point 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDDGFLTR</name>
              <description>IDDIG Filter Enable (IddgFltr)</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Iddig Filter Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Iddig Filter Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALIDFLTR</name>
              <description>VBUS Valid Filter Enabled (VBusValidFltr)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Vbus Valid Filter Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Vbus Valid Filter Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVALIDFLTR</name>
              <description>a_valid Filter Enabled (AValidFltr)</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No filter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Filter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BVALIDFLTR</name>
              <description>b_valid Filter Enabled (BValidFltr)</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No Filter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Filter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESSENDFLTR</name>
              <description>session_end Filter Enabled (SessEndFltr)</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No filter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Filter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEDFIFOMODE</name>
              <description>Enable Dedicated Transmit FIFO for device IN Endpoints</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Dedicated Transmit FIFO Operation not enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Dedicated Transmit FIFO Operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPS</name>
              <description>Number of Device Mode IN Endpoints Including Control Endpoints (INEps)</description>
              <lsb>26</lsb>
              <msb>29</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENDPT1</name>
                  <description>1 IN Endpoint</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT2</name>
                  <description>2 IN Endpoints</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT3</name>
                  <description>3 IN Endpoints</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT4</name>
                  <description>4 IN Endpoints</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT5</name>
                  <description>5 IN Endpoints</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT6</name>
                  <description>6 IN Endpoints</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT7</name>
                  <description>7 IN Endpoints</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT8</name>
                  <description>8 IN Endpoints</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT9</name>
                  <description>9 IN Endpoints</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT10</name>
                  <description>10 IN Endpoints</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT11</name>
                  <description>11 IN Endpoints</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT12</name>
                  <description>12 IN Endpoints</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT13</name>
                  <description>13 IN Endpoints</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT14</name>
                  <description>14 IN Endpoints</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT15</name>
                  <description>15 IN Endpoints</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPT16</name>
                  <description>16 IN Endpoints</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DESCDMAENABLED</name>
              <description>Scatter/Gather DMA configuration</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
