adamkondraciuk/nrfx/mdk/nrf54h20_engb_ppr.svd
          <register>
            <name>INTRSTATUSEN</name>
            <description>Interrupt Status Enable Register.</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXTHLDSTSEN</name>
                <description>Transmit Buffer Threshold Status Enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RXTHLDSTSEN</name>
                <description>Receive Buffer Threshold Status Enable</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>IBITHLDSTSEN</name>
                <description>IBI Buffer Threshold Status Enable.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CMDQUEUEREADYSTSEN</name>
                <description>Command Queue Ready Status Enable</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RESPREADYSTSEN</name>
                <description>Response Queue Ready Status Enable</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TRANSFERABORTSTSEN</name>
                <description>Transfer Abort Status Enable.</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CCCUPDATEDSTSEN</name>
                <description>CCC Table Updated Status Enable.</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DYNADDRASSGNSTSEN</name>
                <description>Dynamic Address Assigned Status Enable</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TRANSFERERRSTSEN</name>
                <description>Transfer Error Status Enable</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DEFSLVSTSEN</name>
                <description>Define Slave CCC Received Status Enable</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>READREQRECVSTSEN</name>
                <description>Read Request Received Status Enable</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IBIUPDATEDSTSEN</name>
                <description>IBI Updated Status Enable</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>BUSOWNERUPDATEDSTSEN</name>
                <description>Bus owner Updated Status Enable</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>BUSRESETDONESTSEN</name>
                <description>Bus Reset Pattern Generation Done Status Enable.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTRSIGNALEN</name>
            <description>Interrupt Signal Enable Register</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXTHLDSIGNALEN</name>
                <description>Transmit Buffer Threshold Signal Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>RXTHLDSIGNALEN</name>
                <description>Receive Buffer Threshold Signal Enable</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>IBITHLDSIGNALEN</name>
                <description>IBI Buffer Threshold Signal Enable</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>CMDQUEUEREADYSIGNALEN</name>
                <description>Command Queue Ready Signal Enable</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RESPREADYSIGNALEN</name>
                <description>Response Queue Ready Signal Enable</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TRANSFERABORTSIGNALEN</name>
                <description>Transfer Abort Signal Enable</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CCCUPDATEDSIGNALEN</name>
                <description>CCC Table Updated Signal Enable</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DYNADDRASSGNSIGNALEN</name>
                <description>Dynamic Address Assigned Signal Enable</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TRANSFERERRSIGNALEN</name>
                <description>Transfer Error Signal Enable</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>DEFSLVSIGNALEN</name>
                <description>Define Slave CCC Received Signal Enable</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>READREQRECVSIGNALEN</name>
                <description>Read Request Received Signal Enable</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>IBIUPDATEDSIGNALEN</name>
                <description>IBI Updated Signal Enable</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>BUSOWNERUPDATEDSIGNALEN</name>
                <description>Bus owner Updated Signal Enable</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>BUSRESETDONESIGNALEN</name>
                <description>Bus Reset Pattern Generation Done Signal Enable.</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTRFORCE</name>
            <description>Interrupt Force Enable Register</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXTHLDFORCEEN</name>
                <description>Transmit Buffer Threshold Force Enable</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RXTHLDFORCEEN</name>
                <description>Receive Buffer Threshold Force Enable</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>IBITHLDFORCEEN</name>
                <description>IBI Buffer Threshold Force Enable</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>CMDQUEUEREADYFORCEEN</name>
                <description>Command Queue Ready Force Enable</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RESPREADYFORCEEN</name>
                <description>Response Queue Ready Force Enable</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>TRANSFERABORTFORCEEN</name>
                <description>Transfer Abort Force Enable</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>CCCUPDATEDFORCEEN</name>
                <description>CCC Table Updated Force Enable</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>DYNADDRASSGNFORCEEN</name>
                <description>Dynamic Address Assigned Force Enable</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>TRANSFERERRFORCEEN</name>
                <description>Transfer Error Force Enable</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>DEFSLVFORCEEN</name>
                <description>Define Slave CCC Received Force Enable</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>READREQFORCEEN</name>
                <description>Read Request Received Force Enable</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>IBIUPDATEDFORCEEN</name>
                <description>IBI Updated Force Enable</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>BUSOWNERUPDATEDFORCEEN</name>
                <description>Bus owner Updated Force Enable</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>BUSRESETDONEFORCEEN</name>
                <description>Bus Reset Pattern Generation Done Force Enable.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>QUEUESTATUSLEVEL</name>
            <description>Queue Status Level Register.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDQUEUEEMPTYLOC</name>
                <description>Command Queue Empty Locations.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RESPBUFBLR</name>
                <description>Response Buffer Level Value.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIBUFBLR</name>
                <description>IBI Buffer Level Value.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IBISTSCNT</name>
                <description>IBI Buffer Status Count.</description>
                <lsb>24</lsb>
                <msb>28</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATABUFFERSTATUSLEVEL</name>
            <description>Data Buffer Status Level Register.</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000040</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXBUFEMPTYLOC</name>
                <description>Transmit Buffer Empty Level Value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>RXBUFBLR</name>
                <description>Receive Buffer Level Value.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
