adamkondraciuk/nrfx/mdk/nrf54h20_engb_ppr.svd
            <register>
              <name>STATUSINT</name>
              <description>The contents of each of the five Status registers  StatusTfr, StatusBlock, StatusSrcTran, StatusDstTran, StatusErr  is ORed to produce a single bit for each interrupt type in the Combined Status register (StatusInt).</description>
              <addressOffset>0x0A0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TFR</name>
                  <description>OR of the contents of StatusTfr register</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>BLOCK</name>
                  <description>OR of the contents of StatusBlock register</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SRCT</name>
                  <description>OR of the contents of StatusSrcTran</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DSTT</name>
                  <description>OR of the contents of StatusDstTran</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ERR</name>
                  <description>OR of the contents of StatusErr</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SWHANDSHAKE</name>
            <description>Unspecified</description>
            <headerStructName>I3CCORE_DMA_SWHANDSHAKE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x368</addressOffset>
            <register>
              <name>REQSRCREG</name>
              <description>A bit is assigned for each channel in this register.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SRCREQ</name>
                  <description>Source Software Transaction Request</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDREQSRCREG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SRCREQWE</name>
                  <description>Source Software Transaction Request write enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>REQDSTREG</name>
              <description>A bit is assigned for each channel in this register.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DSTREQ</name>
                  <description>Destination Software Transaction Request</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDREQDSTREG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DSTREQWE</name>
                  <description>Destination Software Transaction Request write enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SGLRQSRCREG</name>
              <description>A bit is assigned for each channel in this register.</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SRCSGLREQ</name>
                  <description>Source Single Transaction Request</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSGLRQSRCREG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SRCSGLREQWE</name>
                  <description>Source Single Transaction Request write enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SGLRQDSTREG</name>
              <description>A bit is assigned for each channel in this register.</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DSTSGLREQ</name>
                  <description>Destination Single Transaction Request</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSGLRQDSTREG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DSTSGLREQWE</name>
                  <description>Destination Single Transaction Request write enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>LSTSRCREG</name>
              <description>A bit is assigned for each channel in this register.</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LSTSRC</name>
                  <description>Source Last Transaction Request register</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_LAST</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LAST</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDLSTSRCREG</name>
                  <description>Reserved field- read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>LSTSRCWE</name>
                  <description>Source Last Transaction Request write enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>LSTDSTREG</name>
              <description>A bit is assigned for each channel in this register.</description>
              <addressOffset>0x028</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LSTDST</name>
                  <description>Destination Last Transaction Request</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_LAST</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LAST</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDLSTDSTREG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>LSTDSTWE</name>
                  <description>Source Last Transaction Request write enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>MISC</name>
            <description>Unspecified</description>
            <headerStructName>I3CCORE_DMA_MISC</headerStructName>
            <access>read-write</access>
            <addressOffset>0x398</addressOffset>
            <register>
              <name>DMACFGREG</name>
              <description>This register is used to enable the DW_ahb_dmac, which must be done before any channel activity can begin.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMAEN</name>
                  <description>DW_ahb_dmac Enable bit.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CHENREG</name>
              <description>This is the DW_ahb_dmac Channel Enable Register.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHEN</name>
                  <description>Channel Enable.</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDCHENREG</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CHENWE</name>
                  <description>Channel enable register</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMAIDREG</name>
              <description>This is the DW_ahb_dmac ID register, which is a read-only register that reads back the coreConsultant-configured hardcoded ID number, DMAH_ID_NUM.</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMAID</name>
                  <description>Hardcoded DW_ahb_dmac peripheral ID.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMATESTREG</name>
              <description>This register is used to put the AHB slave interface into test mode, during which the readback value of the writable registers match the value written, assuming the DW_ahb_dmac configuration has not optimized the same registers.</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TESTSLVIF</name>
                  <description>DMA Test register</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NORMAL_MODE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TEST_MODE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
