adamkondraciuk/nrfx/mdk/nrf54h20_engb_ppr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_QDEC130">
      <name>GLOBAL_QDEC131</name>
      <description>Quadrature Decoder 1</description>
      <baseAddress>0x5F995000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>QDEC131</name>
        <value>405</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TDM130">
      <name>GLOBAL_TDM131</name>
      <description>Time division multiplexed audio interface 1</description>
      <baseAddress>0x5F997000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TDM131</name>
        <value>407</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120">
      <name>GLOBAL_DPPIC133</name>
      <description>Distributed programmable peripheral interconnect controller 4</description>
      <baseAddress>0x5F9A1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER130</name>
      <description>Timer/Counter 2</description>
      <baseAddress>0x5F9A2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER130</name>
        <value>418</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER131</name>
      <description>Timer/Counter 3</description>
      <baseAddress>0x5F9A3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER131</name>
        <value>419</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120">
      <name>GLOBAL_PWM130</name>
      <description>Pulse width modulation unit 1</description>
      <baseAddress>0x5F9A4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM130</name>
        <value>420</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM130</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS130</name>
      <description>SPI Slave 1</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_TWIM130</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 0</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130</alternatePeripheral>
      <headerStructName>TWIM</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
      <groupName>TWIM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop TWI transaction. Must be issued while the TWI master is not suspended.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop TWI transaction. Must be issued while the TWI master is not suspended.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SUSPEND</name>
          <description>Suspend TWI transaction</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_SUSPEND</name>
              <description>Suspend TWI transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RESUME</name>
          <description>Resume TWI transaction</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_RESUME</name>
              <description>Resume TWI transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TASKS_DMA</name>
          <description>Peripheral tasks.</description>
          <headerStructName>TWIM_TASKS_DMA</headerStructName>
          <access>write-only</access>
          <addressOffset>0x028</addressOffset>
          <cluster>
            <name>RX</name>
            <description>Peripheral tasks.</description>
            <headerStructName>TWIM_TASKS_DMA_RX</headerStructName>
            <access>write-only</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>START</name>
              <description>Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA.</description>
              <addressOffset>0x000</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>START</name>
                  <description>Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STOP</name>
              <description>Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel) will also enter its lowest required power level.</description>
              <addressOffset>0x004</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STOP</name>
                  <description>Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel) will also enter its lowest required power level.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>ENABLEMATCH[%s]</name>
              <description>Description collection: Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register.</description>
              <addressOffset>0x008</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLEMATCH</name>
                  <description>Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DISABLEMATCH[%s]</name>
              <description>Description collection: Disables the MATCH[n] event by clearing the ENABLE[n] bit in the CONFIG register.</description>
              <addressOffset>0x018</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DISABLEMATCH</name>
                  <description>Disables the MATCH[n] event by clearing the ENABLE[n] bit in the CONFIG register.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>TX</name>
            <description>Peripheral tasks.</description>
            <headerStructName>TWIM_TASKS_DMA_TX</headerStructName>
            <access>write-only</access>
            <addressOffset>0x028</addressOffset>
            <register>
              <name>START</name>
              <description>Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA.</description>
              <addressOffset>0x000</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>START</name>
                  <description>Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STOP</name>
              <description>Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel) will also enter its lowest required power level.</description>
              <addressOffset>0x004</addressOffset>
              <access>write-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STOP</name>
                  <description>Stops operation using easyDMA. This does not trigger an END event. After a STOP task, the easyDMA (channel) will also enter its lowest required power level.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Trigger</name>
                      <description>Trigger task</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_SUSPEND</name>
          <description>Subscribe configuration for task SUSPEND</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task SUSPEND will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_RESUME</name>
          <description>Subscribe configuration for task RESUME</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task RESUME will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>SUBSCRIBE_DMA</name>
          <description>Subscribe configuration for tasks</description>
          <headerStructName>TWIM_SUBSCRIBE_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0A8</addressOffset>
          <cluster>
            <name>RX</name>
            <description>Subscribe configuration for tasks</description>
            <headerStructName>TWIM_SUBSCRIBE_DMA_RX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>START</name>
              <description>Subscribe configuration for task START</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that task START will subscribe to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable subscription</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable subscription</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STOP</name>
              <description>Subscribe configuration for task STOP</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that task STOP will subscribe to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable subscription</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable subscription</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>ENABLEMATCH[%s]</name>
              <description>Description collection: Subscribe configuration for task ENABLEMATCH[n]</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that task ENABLEMATCH[n] will subscribe to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable subscription</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable subscription</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DISABLEMATCH[%s]</name>
              <description>Description collection: Subscribe configuration for task DISABLEMATCH[n]</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CHIDX</name>
                  <description>DPPI channel that task DISABLEMATCH[n] will subscribe to</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>EN</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable subscription</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable subscription</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
