adamkondraciuk/nrfx/mdk/nrf54h20_engb_ppr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE130</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x5F9A5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM130</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL0</name>
        <value>421</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM131</name>
      <description>Serial Peripheral Interface Master with EasyDMA 3</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS131</name>
      <description>SPI Slave 2</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM131</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS131</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE131</name>
      <description>UART with EasyDMA 2</description>
      <baseAddress>0x5F9A6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM131</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL1</name>
        <value>422</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120">
      <name>GLOBAL_DPPIC134</name>
      <description>Distributed programmable peripheral interconnect controller 5</description>
      <baseAddress>0x5F9B1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER132</name>
      <description>Timer/Counter 4</description>
      <baseAddress>0x5F9B2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER132</name>
        <value>434</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER133</name>
      <description>Timer/Counter 5</description>
      <baseAddress>0x5F9B3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER133</name>
        <value>435</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120">
      <name>GLOBAL_PWM131</name>
      <description>Pulse width modulation unit 2</description>
      <baseAddress>0x5F9B4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM131</name>
        <value>436</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM132</name>
      <description>Serial Peripheral Interface Master with EasyDMA 4</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS132</name>
      <description>SPI Slave 3</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM132</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS132</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE132</name>
      <description>UART with EasyDMA 3</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM133</name>
      <description>Serial Peripheral Interface Master with EasyDMA 5</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS133</name>
      <description>SPI Slave 4</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
